/**
 * プライバシーポリシー
 */
export const PrivacyPolicy = () => {
  return (
    <div className="md:max-w-2xl md:mx-auto">
      <div className="flex flex-col items-center text-gray-600 p-3 border-b-1">
        <p>「もしも100日後に人生が終わるなら」</p>
        <h1 className="text-2xl font-bold">プライバシーポリシー</h1>
      </div>

      <div className="px-3 text-gray-500 text-sm flex flex-col gap-2">
        <h2 className="text-xl font-bold text-gray-600">
          プライバシーポリシー
        </h2>
        <p>
          このプライバシーポリシー（以下，「本ポリシー」といいます。）は，ユーザーが本アプリケーション（以下，「本アプリ」といいます。）の利用に関して適用されます。
        </p>
        <h3 className="text-lg font-bold text-gray-600">第1条（個人情報）</h3>
        <p>
          本アプリの運営者は，ユーザーの個人情報を適切に取り扱うために，以下の方針を定めます。
        </p>
        <h3 className="text-lg font-bold text-gray-600">
          第2条（個人情報の収集方法）
        </h3>
        <p>
          本アプリの運営者は，ユーザーが利用登録をする際に氏名，メールアドレスなどの個人情報を収集することがあります。
        </p>
        <h3 className="text-lg font-bold text-gray-600">
          第3条（個人情報の利用目的）
        </h3>
        <p>本アプリの運営者は，収集した個人情報を以下の目的で利用します。</p>
        <ul className="list-disc list-inside">
          <li>本アプリの提供・運営のため</li>
          <li>ユーザーからのお問い合わせに回答するため</li>
          <li>メンテナンス，重要なお知らせなどのご連絡のため</li>
          <li>
            利用規約に違反したユーザーや，不正・不当な目的で本アプリを利用しようとするユーザーの特定をし，ご利用をお断りするため
          </li>
          <li>
            ユーザーにご自身の登録情報の閲覧や変更，削除，利用状況の閲覧を行っていただくため
          </li>
          <li>上記の利用目的に付随する目的</li>
        </ul>
        <h3 className="text-lg font-bold text-gray-600">
          第4条（個人情報の第三者提供）
        </h3>
        <p>
          本アプリの運営者は，次に掲げる場合を除いて，あらかじめユーザーの同意を得ることなく，第三者に個人情報を提供することはありません。
        </p>
        <ul className="list-disc list-inside">
          <li>法令に基づく場合</li>
          <li>人の生命，身体または財産の保護のために必要がある場合</li>
          <li>
            公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合
          </li>
          <li>
            国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合
          </li>
          <li>
            予め次の事項を告知あるいは公表し，かつ本アプリの運営者が個人情報保護委員会に届出をした場合
          </li>
        </ul>
        <h3 className="text-lg font-bold text-gray-600">
          第5条（個人情報の開示）
        </h3>
        <p>
          本アプリの運営者は，ユーザーから個人情報の開示を求められたときは，ユーザーご本人からの請求であることを確認の上，開示します。
        </p>
        <h3 className="text-lg font-bold text-gray-600">
          第6条（個人情報の訂正および削除）
        </h3>
        <p>
          ユーザーは，本アプリの運営者が保有する自己の個人情報が誤った情報である場合には，本アプリの運営者が定める手続きにより，個人情報の訂正または削除を請求することができます。
        </p>
        <h3 className="text-lg font-bold text-gray-600">
          第7条（個人情報の利用停止等）
        </h3>
        <p>
          本アプリの運営者は，ユーザーから，個人情報が利用目的の範囲を超えて取り扱われているという理由，または不正に取得されたものであるという理由により，その利用の停止または消去を求められた場合には，遅滞なく必要な調査を行い，その結果に基づき，個人情報の利用停止または消去を行います。
        </p>
        <h3 className="text-lg font-bold text-gray-600">
          第8条（プライバシーポリシーの変更）
        </h3>
        <p>
          本ポリシーの内容は，ユーザーに通知することなく，変更することができるものとします。変更後のプライバシーポリシーは，本アプリに掲載したときから効力を生じるものとします。
        </p>
        <h3 className="text-lg font-bold text-gray-600">
          第9条（お問い合わせ窓口）
        </h3>
        <p>
          本ポリシーに関するお問い合わせは，下記の窓口までメッセージをお願いいたします。
        </p>
        <p>【連絡先】</p>
        <p>開発者アカウント: https://x.com/watt__007</p>
      </div>
    </div>
  );
};
